// "let Gavno = 10" чтобы создать переменную пишем ключевое слово let и даем переменной имя и знаком присваивания чото задаем ей 
// Для создания переменных используются var let и const, в настоящий момент использ только let и const, поэтому вар идет нафек.
// Отличие лет и конст заключается в том что лет можно изменять, конст это константа которую нельзя изменить.
// кста let использ тока для создания переменной Govno если мы захотим изменить значение переменной то надо писать просто имя переменной и равно нпрмр: Govno = 5
// кста с помощью лет можно создавать переменные без значения типа 'let Govno' ивсе, если мы захотим вывести переменную, то на покажут 'undefined' тойесть значение не определено



let a = false 

a = String(a)

console.dir()